# Dataframes

Dataframes are mutable two-dimensional dat structures with the axes labeled where:
* each row represents a different observation
* each column represents a different variable

In Python, to define a dataframe, we first need to import the pandas module.

In [ ]:
import pandas as pd

Next, if we want a dataframe with 5 rows and 2 columns, we can do it from a [dictionary](https://www.w3schools.com/python/python_dictionaries.asp), a [list](https://www.w3schools.com/python/python_lists.asp) of lists, a list of dictionaries, etc.

We are going to create a 5-rows, 2-columns dataframe from a dictionary.

To do this, we first create a dictionary where the keys will be the names of the columns and the values will be lists, with as many elements as the number of rows we want.

Finally, we convert that dictionary to dataframe with pandas' `DataFrame()` function:

In [ ]:
# Example dataframe
data = {
    "x":[1, 2, 3, 4, 5], 
    "y":[6, 7, 8, 9, 10]
}

In [ ]:
data['x']

In [ ]:
df = pd.DataFrame(data)
print(df)
# df

As we said, we have created a dataframe with 5 rows and two columns, called x and y respectively.

**Observation**: As a result of `print()`, we have not only obtained the 5 rows and 2 columns, but there is an additional column of 5 numbers ordered vertically from 0 to 4. It is simply the name of each row, which by default is the index of each row. The 0 indicates the first row; the 1, the second; and so on.

## Import a csv file to dataframe

In [ ]:
# use contextual help to show all the parameters inside read_csv
df = pd.read_csv('/Users/riasnazary/_jupyterlab/eniac-data/orderlines.csv', sep=',')
df

## Dataframe dimensions

With the `.shape` [method](https://www.w3schools.com/python/gloss_python_object_methods.asp) we can calculate the dimensions (number of rows and columns) of the dataframe.

In [ ]:
df.shape

As a result we obtain a [tuple](https://www.w3schools.com/python/python_tuples.asp) where the first element is the number of rows, which in our case is 293983, while the second element is the number of columns, which in our example was 7.

In [ ]:
nrows = df.shape[0]
ncols = df.shape[1]
print("The number of rows is", nrows)
print("The number of columns is", ncols)

With the `.size` method we calculate the total number of values that the dataframe has (number of rows per number of columns)

In [ ]:
df.size

In [ ]:
# check if that's true
df.shape[0] * df.shape[1] == df.size

With the `.ndim` method we calculate the number of dimensions that the dataframe has. This will always be 2, as it consists of rows and columns.

In [ ]:
df.ndim

## Dataframes exploration

The `.head()` method is used to display the first rows of the dataframe. By default, the first 5 will be shown

In [ ]:
df.head()

In [ ]:
df.head(9)

In [ ]:
df.tail()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.nunique()

In [ ]:
df['sku'].unique().tolist()[:10]

In [ ]:
df.isna().sum()

In [ ]:
df.duplicated().sum() # parameters keep=False
# df.drop_duplicates()

In [ ]:
df.nsmallest(5, 'product_quantity')

In [ ]:
df.nlargest(5, 'product_quantity')

## Columns

Given a dataframe, we can select a particular column in several ways:

* Indicating the name of the column between square brackets, []
* With the `.columns[]` method
* With the `.loc[]` method (by name or tag)
* With the `.iloc[]` method (by position)

How to select 1 column

In [ ]:
# select the column by name
df['id_order']

In [ ]:
# Select the column sku with the method .columns[]
print(df[df.columns[1]])

In [ ]:
# method .loc[]
print(df.loc[:, 'id_order'])

In [ ]:
# method .iloc[]
print(df.iloc[:, 0])

In [ ]:
# method .filter()
df.filter(items=['id_order'])

Select multiple columns

If we wanted to select more than one column, we could do it with all the options listed above, with slight modifications in some cases:

In [ ]:
# with a list
df[['id_order','sku']]

In [ ]:
# .columns()
df[df.columns[[1,4]]]

In [ ]:
df[df.columns[0:3]]

In [ ]:
# .loc()
df.loc[:, ["id_order", "sku"]]

In [ ]:
# .loc()
df.loc[:, "id_order":"sku"]

In [ ]:
# .iloc
df.iloc[:, [0, 1]]

In [ ]:
df.iloc[:, 0:2]

## Rows

Given a dataframe, we can select a particular row in several ways:

* With the `.loc[]` method (by name or tag)
* With the `.iloc[]` method (by position)

In [ ]:
# set the id to rows_id

In [ ]:
df.set_index('id', inplace=True)
# inplate = True would be equal than df = df.set_index('id')

In [ ]:
df.head(2)

In [ ]:
# select the first observation with the .loc() method
df.loc[1119110]

In [ ]:
# select the last observation with the method .iloc[]
df.iloc[-1]
# df.tail(1)

In [ ]:
df.head()

In [ ]:
df.loc[[1119111,1119112,1119113]]

In [ ]:
df.loc[1119111:1119113]

In [ ]:
df.reset_index(inplace=True)

## Drop and Filter data

In [ ]:
df.head()

In [ ]:
df.columns

The `.drop()` method allows us to delete the rows or columns that we indicate.

**Attention!** Again, if we want to directly apply the changes to the original dataframe, we need to indicate `inplace = True`

In [ ]:
df.drop(['unit_price'], axis=1)

How to filter information on a dataframe.

In [ ]:
# products sold in quantities larger than 100
df[df['product_quantity'] > 100]

The `.query()` method can be useful for this purpose, but it works only when the column values do not contain blank spaces. You can use any **Python Comparison Operators** you want inside the query method (find more information on this [link](https://www.w3schools.com/python/python_operators.asp)).

In [ ]:
df.query('product_quantity > 100')

Another way to filter information is to look for exact matches. You can do that with the `isin()` method:

In [ ]:
# find out rows in a column that match the elements in a list
df[df['sku'].isin(['ADN0039','THU0029','APP1190'])]

## `.copy()` method

If you want to create a new dataframe out of a chunk of the original dataframe, it is quite common to run into this problem:

In [ ]:
sample = df.iloc[:3,:]
sample

In [ ]:
sample.iloc[0,4]

In [ ]:
sample.iloc[0,4] = 'NEW001'

In [ ]:
sample

In [ ]:
df.head()

As you can see, we modified the object `sample` but, the data frame `df` has also been modified! We can avoid this using the method `.copy()`

In [ ]:
df = pd.read_csv('../data/eniac/orderlines.csv')
sample = df.iloc[:3,:].copy()
sample.iloc[0,4] = 'NEW001'
sample

In [ ]:
df.head(3)

As you can see, now it has not been modified.

# CHALLENGES

1. The product with the `sku` JBL0104 has been sold for prices at different points in time. How many different prices has it had?

Tip: combine any pandas filtering method with the method `.nunique()`.

In [195]:
df[df.sku == 'JBL0104'].unit_price.nunique()

7

2. List all the different items that have been sold in the order with an `id_order` of `385921`.

In [197]:
df[df.id_order == 385921]

,id_order,id,product_id,product_quantity,sku,unit_price,date
100355,385921,1310787,0,1,APP2431,2.114.59,2017-08-03 17:49:00
100359,385921,1310794,0,1,APP2348,3.805.59,2017-08-03 17:54:39
100360,385921,1310796,0,1,APP2131,992.81,2017-08-03 17:57:23
100364,385921,1310800,0,1,APP1630,1.020.33,2017-08-03 18:04:06
100365,385921,1310801,0,1,APP1735,469.00,2017-08-03 18:04:24
100366,385921,1310802,0,1,APP1216,139.99,2017-08-03 18:05:04
100368,385921,1310804,0,1,APP2092,149.00,2017-08-03 18:06:07
100371,385921,1310807,0,1,APP1215,110.99,2017-08-03 18:07:18
100374,385921,1310810,0,1,ELA0017,32.99,2017-08-03 18:08:25
100379,385921,1310815,0,2,MIN0010,69.99,2017-08-03 18:10:24
100384,385921,1310821,0,1,ELA0039,9.99,2017-08-03 18:12:12
100386,385921,1310823,0,1,BEA0046,99.90,2017-08-03 18:12:59
100387,385921,1310825,0,1,BOS0034,249.99,2017-08-03 18:13:19
100390,385921,1310828,0,1,BEA0071,269.99,2017-08-03 18:14:24
100391,385921,1310830,0,2,ELA0029,29.99,2017-08-03 18:14:50
100392,385921,1310832,0,1,APP2161,179.00,2017-08-03 18:17:26
100399,385921,1310846,0,1,HOC0008,29.99,2017-08-03 18:32:41
100400,385921,1310847,0,1,NOM0026,39.99,2017-08-03 18:33:21
100401,385921,1310848,0,1,NOM0014,59.99,2017-08-03 18:34:43

3. Find out in how many different orders have been sold the products with the following `sku`: `APP2431` and `APP2348`.

In [198]:
df[df.sku.isin(['APP2431', 'APP2348'])].id_order.nunique()

179

4. Create a new dataframe with all the rows that have a product quantity higher than 500. Call this new dataframe `df_50`, and include only the columns `id`, `id_order`, `product_quantity` and `sku`. Be sure to use the method `.copy()`. 

Once the dataset is created, modify the column `product_quantity` to `quantity`, and `sku'` to `product_code`. To do so, you can use the methods `.rename()` or `.columns`.

In [201]:
df_50 = df[df.product_quantity > 500][['id', 'id_order', 'product_quantity', 'sku']].copy()
df_50.rename({'product_quantity': 'quantity', 'sku': 'product_code'}, axis=1, inplace=True)
df_50

,id_order,id,product_id,product_quantity,sku,unit_price,date
53860,346221,1228150,0,999,APP1190,55.99,2017-04-14 21:50:52
57306,349133,1234111,0,555,APP0665,70.99,2017-04-24 10:20:13
57796,349475,1234924,0,800,KIN0137,7.49,2017-04-25 09:59:00
68712,358747,1254032,0,999,SEV0028,19.99,2017-05-24 14:51:58

5. Select all the order lines (i.e. all the rows) where the product `XDO0047` has appeared. Sort the product quantity in a DESCENDING order using the pandas method [`.sort_values()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html). Then look at the main descriptive information of this results with the method `.describe()`.

In [202]:
df[df.sku=='XDO0047'].sort_values('product_quantity', ascending=False)

,id_order,id,product_id,product_quantity,sku,unit_price,date
285492,522075,1637611,0,125,XDO0047,25.99,2018-03-06 10:07:54
203932,464239,1499415,0,2,XDO0047,25.99,2017-12-16 09:36:51
124018,406387,1365515,0,1,XDO0047,23.39,2017-09-29 17:09:32
238277,491065,1561096,0,1,XDO0047,25.99,2018-01-15 09:39:07
186320,454473,1474709,0,1,XDO0047,25.99,2017-12-03 17:05:14
197678,460182,1489835,0,1,XDO0047,25.99,2017-12-11 20:28:12
216416,475450,1523205,0,1,XDO0047,25.99,2017-12-28 20:44:19
217466,476341,1525182,0,1,XDO0047,22.09,2017-12-29 15:39:11
217957,476848,1526191,0,1,XDO0047,22.09,2017-12-29 21:32:50
246332,496429,1574873,0,1,XDO0047,25.99,2018-01-22 23:03:34
134170,415390,1383903,0,1,XDO0047,25.99,2017-10-21 01:03:55
249677,498216,1579784,0,1,XDO0047,25.99,2018-01-25 10:37:25
251953,499709,1583471,0,1,XDO0047,25.99,2018-01-27 17:52:28
265822,507776,1604972,0,1,XDO0047,25.99,2018-02-07 19:19:13
275501,514654,1620872,0,1,XDO0047,25.99,2018-02-20 09:08:00
278758,517103,1626412,0,1,XDO0047,25.99,2018-02-25 10:56:20
285641,522203,1637907,0,1,XDO0047,25.99,2018-03-06 13:54:01
186126,454367,1474463,0,1,XDO0047,25.99,2017-12-03 13:20:08
184876,453923,1473085,0,1,XDO0047,25.99,2017-12-02 21:48:27
182659,452571,1469771,0,1,XDO0047,25.99,2017-11-30 12:37:23
145407,424898,1404047,0,1,XDO0047,25.99,2017-11-11 10:22:19
134716,415827,1384827,0,1,XDO0047,25.99,2017-10-22 18:16:59
136618,417320,1388160,0,1,XDO0047,25.99,2017-10-25 13:36:49
137225,418038,1389335,0,1,XDO0047,25.99,2017-10-26 12:40:41
137682,418446,1390163,0,1,XDO0047,25.99,2017-10-27 08:49:01
143899,423284,1401174,0,1,XDO0047,22.09,2017-11-09 10:44:37
144132,423903,1401567,0,1,XDO0047,25.99,2017-11-09 17:53:32
146716,425651,1406425,0,1,XDO0047,25.99,2017-11-13 11:25:32
181401,451784,1467890,0,1,XDO0047,21.48,2017-11-29 13:13:16
153645,428540,1422736,0,1,XDO0047,22.09,2017-11-22 21:25:51
156369,434389,1427484,0,1,XDO0047,22.09,2017-11-23 12:54:12
157336,435298,1429263,0,1,XDO0047,22.09,2017-11-23 17:54:14
157683,435601,1429912,0,1,XDO0047,22.09,2017-11-23 19:50:43
157691,435609,1429925,0,1,XDO0047,22.09,2017-11-23 19:52:49
164430,439528,1441619,0,1,XDO0047,22.09,2017-11-24 19:40:48
287315,523533,1640821,0,1,XDO0047,25.99,2018-03-08 23:14:14

In [203]:
df[df.sku=='XDO0047'].sort_values('product_quantity', ascending=False).describe()

            id_order            id  product_id  product_quantity
count      36.000000  3.600000e+01        36.0         36.000000
mean   458640.277778  1.485767e+06         0.0          4.472222
std     36891.598431  8.770532e+04         0.0         20.662576
min    406387.000000  1.365515e+06         0.0          1.000000
25%    425462.750000  1.405830e+06         0.0          1.000000
50%    453247.000000  1.471428e+06         0.0          1.000000
75%    492406.000000  1.564540e+06         0.0          1.000000
max    523533.000000  1.640821e+06         0.0        125.000000